Repository: common-repository/staempfli-crowd-login
Catalog: languages/staempfli-crowd-*.po
Languages: de_de

source: Test settings
de_de: Einstellungen Testen

source: Settings
de_de: Einstellungen

source: Crowd URL
de_de: Crowd Login

source: Application Name
de_de: Applikationsname

source: Application Password
de_de: Applikationskennwort

source: Login Mode
de_de: Loginmodus

source: Group
de_de: Gruppe

source: Security Mode
de_de: Sicherheitsmodus

source: Account Type
de_de: Konto Typ

source: Username
de_de: Benutzername

source: Password
de_de: Kennwort

source: User successfully authenticated with given configuration.
de_de: Benutzer erfolgreich mit der aktuellen Konfiguration authentifiziert.

source: User authenticated failed. Please check your configuration.
de_de: Authentifizierung fehlgeschlagen. Bitte überprüfen Sie Ihre Konfiguration.

source: Example: https://crowd.server.com:8080/crowd
de_de: Beispiel: https://crowd.server.com:8080/crowd

source: The application name specified in the Atlassian Crowd backend.
de_de: Der im Atlassian Crowd-Backend angegebene Anwendungsname.

source: The application password specified in the Atlassian Crowd backend.
de_de: Das im Atlassian Crowd-Backend angegebene Anwendungskennwort.

source: Authenticate only
de_de: Nur authentifizieren

source: Authenticate user against Atlassian Crowd. No user is created.
de_de: Nur mit Atlassian Crowd authentifizieren. Es wird kein Benutzer erstellt.

source: Create user
de_de: Benutzer erstellen

source: Create WordPress user when successfully authenticated against Atlassian Crowd.
de_de: Benutzer erstellen, wenn erfolgreich mit Atlassian Crowd authentifiziert wurde.

source: Create user when groupmember
de_de: Benutzer erstellen, wenn Gruppenmitglied

source: Create WordPress user only when successfully authenticated against Atlassian Crowd and user is a member of a specified group.
de_de: Benutzer erstellen, wenn erfolgreich mit Atlassian Crowd authentifiziert wurde und der Benutzer Mitglied einer angegebenen Gruppe ist.

source: A WordPress user is only created if the user is a member of this group.
de_de: Ein WordPress-Benutzer wird nur erstellt, wenn der Benutzer Mitglied dieser Gruppe ist.

source: First attempt to login with Atlassian Crowd user, when failing attempt login using the local WordPress users. This can be used to provide a mixed login mode with Atlassian Crowd and WordPress default login.
de_de: Versuche zuerst sich mit dem Atlassian Crowd-Benutzer anzumelden, danach versuche mit den lokalen WordPress-Benutzern anzumelden. Der gemischte Login-Modus ist von Vorteil wenn einige Benutzer nur über einen WordPress-Benutzer und einige über einen Atlassian Crowd Benutzer verfügen.

source: Strict
de_de: Strikt

source: Restrict logins to Atlassian Crowd only. The default WordPress authentication is deactivated.
de_de: Beschränken Sie Logins nur auf Atlassian Crowd. Die standardmäßige WordPress-Authentifizierung ist deaktiviert.

source: Create WordPress user with this role when login mode "create" is selected.
de_de: Erstellen Sie den WordPress-Benutzer mit dieser Rolle, wenn der Anmeldemodus „Benutzer erstellen" ausgewählt ist.

source: <strong>Error</strong>: The username field is empty.
de_de: <strong>Fehler</strong>: Das Feld Benutzername ist leer.

source: <strong>Error</strong>: The password field is empty.
de_de: <strong>Fehler </strong>: Das Passwort-Feld ist leer.

source: <strong>Crowd Login Error</strong>: An error occurred creating the user in WordPress. <br><br>
de_de: <strong>Crowd Login-Fehler</strong>: Beim Erstellen des Benutzers in WordPress ist ein Fehler aufgetreten.<br><br>

source: <strong>Crowd Login Error</strong>: You are not allowed to log in. Please contact your administrator.
de_de: <strong>Crowd Login-Fehler</strong>: Sie sind nicht berechtigt. Wenden Sie sich an Ihren Administrator.

source: <strong>Crowd Login Error</strong>: Crowd Login mode does not permit account creation.
de_de: <strong>Crowd Login-Fehler</strong>: Crowd Login-Modus erlaubt keine Kontoerstellung.

source: <strong>Crowd Login Error</strong>: Authentication failed.
de_de: <strong>Crowd Login-Fehler</strong>: Authentifizierung fehlgeschlagen.

source: <strong>Crowd Login Error</strong>: No Crowd_Client instance available.
de_de: <strong>Crowd Login-Fehler</strong>: Keine Crowd_Client Instanz verfügbar.

source: <strong>Crowd Login Error</strong>: Could not retrieve principal from Atlassian Crowd server.
de_de: <strong>Crowd Login-Fehler</strong>: Principal konnte nicht vom Atlassian Crowd-Server abgerufen werden.

source: This plugin provides a login provider for atlassian crowd.
de_de: Dieses Plugin bietet die Authentifizierung über Atlassian Crowd an.
